
import {Account} from './src/Account';

var account = new Account("XXXXXXXXXX", "***********") //账号信息
  .createOrder(["2018-02-21", "2018-02-22", "2018-02-23", "2018-02-24", "2018-02-25"] //发车日期
               ,"2018-02-25" //返程日期
               ,"焦作", "上海" //出发到达站
               ,["G1821"] //车次
               ,["张三"]) //乘车人姓名 ["张三", "李四"]
  .createOrder(["2018-02-21", "2018-02-22", "2018-02-23", "2018-02-24", "2018-02-25"] //发车日期
               ,"2018-02-25" //返程日期
               ,"郑州", "上海" //出发到达站
               ,["G1804"
               ,"G370"
               ,"G1808"
               ,"G1914"
               ,"G1812"
               ,"G1816"
               ,"G362"
               ,"G2814"
               ,"G1918"
               ,"G1922"
               ,"G1958"
               ,"G1820"
               ,"G1824"
               ,"G1828"
               ,"G1868"
               ,"G1926"
               ,"G1972"
               ,"G1954"], //车次
               ["张三"]) //乘车人姓名 ["张三", "李四"]
               ;

if(process.argv.length === 2) {
  account.submit();
}else {
  account[process.argv[2]].apply(account, process.argv.splice(3));
}
